<a href="https://colab.research.google.com/github/joseperu2503/Librerias-python/blob/main/Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [4]:
import pandas as pd
import numpy as np

#Series

##Crear serie

In [ ]:
sr = pd.Series([10,9,8,7,6])
sr

0    10
1     9
2     8
3     7
4     6
dtype: int64

In [ ]:
sr.values

array([10,  9,  8,  7,  6])

In [ ]:
sr.index

RangeIndex(start=0, stop=5, step=1)

In [ ]:
sr.shape

(5,)

## Mostrar un elemento de la serie

In [ ]:
sr[3]

7

## Mostrar varios elementos de la serie

In [ ]:
sr[[0,4,2]]

0    10
4     6
2     8
dtype: int64

## Crear serie especificando los indices de la *serie*

In [ ]:
sr = pd.Series([10,9,8,7,6], index = ['a','b','c','d','e'])
sr

a    10
b     9
c     8
d     7
e     6
dtype: int64

### Mostrar un elemento de la serie

In [ ]:
sr['c']

8

### Mostrar varios elementos de la serie

In [ ]:
sr[['c','d','e']]

c    8
d    7
e    6
dtype: int64

### Mostrar varios elementos de la serie especificando el rango

In [ ]:
sr['b':'e']

b    9
c    8
d    7
e    6
dtype: int64

#Diccionarios

##Convertir diccionario en serie

In [ ]:
dict_data = {'CO':300,'MX':400,'CH':200}
print(dict_data)
sr = pd.Series(dict_data)
print(sr)

{'CO': 300, 'MX': 400, 'CH': 200}
CO    300
MX    400
CH    200
dtype: int64

##Convertir diccionario en data frame

In [ ]:
#EJEMPLO1
dict_data = {'CH': [100, 800, 200], 'CO': [100, 200, 300], 'MX': [300, 500, 400]}
print(dict_data)
df = pd.DataFrame(dict_data)
print(df)

{'CH': [100, 800, 200], 'CO': [100, 200, 300], 'MX': [300, 500, 400]}
    CH   CO   MX
0  100  100  300
1  800  200  500
2  200  300  400

In [ ]:
#EJEMPLO2
dict_data = {
    'edad' :     [ 10, 9, 13, 14, 12, 11, 12],
    'cm' : [ 115, 110, 130, 155, 125, 120, 125],
    'pais' :    [ 'co', 'mx', 'co', 'mx', 'mx', 'ch', 'ch'],
    'genero' :  [ 'M', 'F', 'F', 'M', 'M', 'M', 'F'],
    'Q1' : [ 5, 10, 8, np.nan, 7, 8, 3],
    'Q2' : [ 7, 9, 9, 8, 8, 8, 9.]
}
dict_data
df = pd.DataFrame(dict_data, index = ['ana','benito','camilo','daniel','erika','fabian','gabriela'])
df

          edad   cm pais genero    Q1   Q2
ana         10  115   co      M   5.0  7.0
benito       9  110   mx      F  10.0  9.0
camilo      13  130   co      F   8.0  9.0
daniel      14  155   mx      M   NaN  8.0
erika       12  125   mx      M   7.0  8.0
fabian      11  120   ch      M   8.0  8.0
gabriela    12  125   ch      F   3.0  9.0

#Data frames

In [ ]:
df

          edad   cm pais genero    Q1   Q2
ana         10  115   co      M   5.0  7.0
benito       9  110   mx      F  10.0  9.0
camilo      13  130   co      F   8.0  9.0
daniel      14  155   mx      M   NaN  8.0
erika       12  125   mx      M   7.0  8.0
fabian      11  120   ch      M   8.0  8.0
gabriela    12  125   ch      F   3.0  9.0

##Consultar los indices del data frame

In [ ]:
df.index

Index(['ana', 'benito', 'camilo', 'daniel', 'erika', 'fabian', 'gabriela'], dtype='object')

## Consultar las columnas del data frame

In [ ]:
df.columns

Index(['edad', 'cm', 'pais', 'genero', 'Q1', 'Q2'], dtype='object')

##Mostrar los valores del data frame

In [ ]:
df.values

array([[10, 115, 'co', 'M', 5.0, 7.0],
       [9, 110, 'mx', 'F', 10.0, 9.0],
       [13, 130, 'co', 'F', 8.0, 9.0],
       [14, 155, 'mx', 'M', nan, 8.0],
       [12, 125, 'mx', 'M', 7.0, 8.0],
       [11, 120, 'ch', 'M', 8.0, 8.0],
       [12, 125, 'ch', 'F', 3.0, 9.0]], dtype=object)

##Mostrar una columna del data frame

In [ ]:
df['edad']

ana         10
benito       9
camilo      13
daniel      14
erika       12
fabian      11
gabriela    12
Name: edad, dtype: int64

##Mostrar varias columnas del data frame

In [ ]:
df[['edad','cm','Q1']]

          edad   cm    Q1
ana         10  115   5.0
benito       9  110  10.0
camilo      13  130   8.0
daniel      14  155   NaN
erika       12  125   7.0
fabian      11  120   8.0
gabriela    12  125   3.0

##Mostrar el data frame restringiendo los indices y columnas

In [ ]:
df.loc[['ana'],['edad','cm','Q1']]

     edad   cm   Q1
ana    10  115  5.0

In [ ]:
df.loc[['ana','erika'],['edad','cm','Q1']]

       edad   cm   Q1
ana      10  115  5.0
erika    12  125  7.0

In [ ]:
#Tambien se puede especificar con su posicion numerica
df.iloc[[0,4],[0,1,2]]

       edad   cm pais
ana      10  115   co
erika    12  125   mx

##Filtrar el data frame

###Condicion

In [ ]:
df['edad'] >= 12

ana         False
benito      False
camilo       True
daniel       True
erika        True
fabian      False
gabriela     True
Name: edad, dtype: bool

In [ ]:
df['Q2'] >= df['Q1']

ana          True
benito      False
camilo       True
daniel      False
erika        True
fabian       True
gabriela     True
dtype: bool

###Mostrar el data frame con datos que cumpla una condicion

In [ ]:
df[df['edad'] >= 12]

          edad   cm pais genero   Q1   Q2
camilo      13  130   co      F  8.0  9.0
daniel      14  155   mx      M  NaN  8.0
erika       12  125   mx      M  7.0  8.0
gabriela    12  125   ch      F  3.0  9.0

In [ ]:
df[(df['edad'] >= 12) & (df['pais'] == 'mx')]

        edad   cm pais genero   Q1   Q2
daniel    14  155   mx      M  NaN  8.0
erika     12  125   mx      M  7.0  8.0

In [ ]:
df[df['Q2'] >= df['Q1']]

          edad   cm pais genero   Q1   Q2
ana         10  115   co      M  5.0  7.0
camilo      13  130   co      F  8.0  9.0
erika       12  125   mx      M  7.0  8.0
fabian      11  120   ch      M  8.0  8.0
gabriela    12  125   ch      F  3.0  9.0

### Usando query

In [ ]:
df.query('edad > 12')

        edad   cm pais genero   Q1   Q2
camilo    13  130   co      F  8.0  9.0
daniel    14  155   mx      M  NaN  8.0

#Guardar CSV

## Conectar con drive

In [1]:
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

##Crear carpeta en drive

In [2]:
!mkdir /content/drive/'My Drive'/Platzi/db

## Crear el data frame

In [5]:
dict_data = {
    'edad' :     [ 10, 9, 13, 14, 12, 11, 12],
    'cm' : [ 115, 110, 130, 155, 125, 120, 125],
    'pais' :    [ 'co', 'mx', 'co', 'mx', 'mx', 'ch', 'ch'],
    'genero' :  [ 'M', 'F', 'F', 'M', 'M', 'M', 'F'],
    'Q1' : [ 5, 10, 8, np.nan, 7, 8, 3],
    'Q2' : [ 7, 9, 9, 8, 8, 8, 9.]
}
dict_data

{'Q1': [5, 10, 8, nan, 7, 8, 3],
 'Q2': [7, 9, 9, 8, 8, 8, 9.0],
 'cm': [115, 110, 130, 155, 125, 120, 125],
 'edad': [10, 9, 13, 14, 12, 11, 12],
 'genero': ['M', 'F', 'F', 'M', 'M', 'M', 'F'],
 'pais': ['co', 'mx', 'co', 'mx', 'mx', 'ch', 'ch']}

In [6]:
df = pd.DataFrame(dict_data)
df

   edad   cm pais genero    Q1   Q2
0    10  115   co      M   5.0  7.0
1     9  110   mx      F  10.0  9.0
2    13  130   co      F   8.0  9.0
3    14  155   mx      M   NaN  8.0
4    12  125   mx      M   7.0  8.0
5    11  120   ch      M   8.0  8.0
6    12  125   ch      F   3.0  9.0

##Definir la variable de la direccion de guardado

In [3]:
dir_pandas = '/content/drive/My Drive/Platzi/db/{}'.format('test.csv')
dir_pandas

'/content/drive/My Drive/Platzi/db/test.csv'

##Guardar data frame como csv

In [7]:
df.to_csv(dir_pandas)

In [8]:
#En caso no se quiera guardar con el indice adicional
df.to_csv(dir_pandas, index = False)

## Guardar csv especificando otro separador

In [9]:
df.to_csv(dir_pandas, sep = '|', index = False)

# Leer csv

In [ ]:
df = pd.read_csv("cars.csv")
df

      manufacturer_name  model_name  ... feature_9 duration_listed
0                Subaru     Outback  ...      True              16
1                Subaru     Outback  ...      True              83
2                Subaru    Forester  ...      True             151
3                Subaru     Impreza  ...     False              86
4                Subaru      Legacy  ...      True               7
...                 ...         ...  ...       ...             ...
38526          Chrysler         300  ...      True             301
38527          Chrysler  PT Cruiser  ...      True             317
38528          Chrysler         300  ...      True             369
38529          Chrysler  PT Cruiser  ...      True             490
38530          Chrysler     Voyager  ...      True             632

[38531 rows x 30 columns]

## Leer csv con otro separador

In [11]:
df_read = pd.read_csv(dir_pandas, sep = '|')
df_read

   edad   cm pais genero    Q1   Q2
0    10  115   co      M   5.0  7.0
1     9  110   mx      F  10.0  9.0
2    13  130   co      F   8.0  9.0
3    14  155   mx      M   NaN  8.0
4    12  125   mx      M   7.0  8.0
5    11  120   ch      M   8.0  8.0
6    12  125   ch      F   3.0  9.0